[
  {
    "objectid": "Company",
    "Name": "Western heartlands",
    "Introducion": "#SCENES 3\nAt least you meet in tavern. All of you leave your settlement about weeks or two ago and mett in this tavern.\nEach of you have all reason to leave settlement.",
    "Start gold": 100
  },
  {
    "objectid": "Adventure",
    "Name": "Flooded collectors",
    "Briefing": "#NPC 50\n\"Well met, my friends.\" Chief of local guard was good spirited. You sit in local tavern. \"My name if Halfast Rodgar. And I am chief of locl guard as you now.\"\n\"We have a problem in collectors. Two our men goind down and not returned. There is a some kind of monsters inside.\n\"I need your help to deal with them. Kill them all. Going down to the last level and kill all of these creatures and our comunity will reward you.\"",
    "Accepted": "#NPC 50\n\"Very well! You are good mens. Let's luck be with you.\"",
    "Entering": "#BUILDNGS 11\nOld collector builded hundred years ago. What lie below the earth?",
    "Rumor": "Since last month people of Baldur's gate myserious disapears. Some old beggar tells story about flooded collectors and monsters, who dwelve in it.",
    "History": {
      "Stage 1": "Years ago we found this place. It's perfect place, fresh food is always on ground and some times adventurers leak there and get rumor from outside.",
      "Stage 2": "Our master want answers. What lie up ground? Big city? How it big and how it reach? Adventurers tell some information but we need more. Master need more!",
      "Stage 3": "This leech is ugly disasters. It come from underground sea, where it hunt a blind fish. But how it get there? Some where must be hole from where it come here."
    },
    "#tab Part 1": {
      "Resource": "BRICK",
      "Monster 1": "Kobold",
      "Monster 2": "Leech",
      "Key 1": "Silver key",
      "Key 2": "Cooper key",
      "Special": "Stone orb",
      "Language": "Human",
      "Curse item": 5,
      "Levels": 2
    },
    "#tab Part 2": {
      "Resource": "BRICK",
      "Monster 1": "Skeleton",
      "Monster 2": "Zombie",
      "Key 1": "Silver key",
      "Key 2": "Cooper key",
      "Special": "Stone dagger",
      "Language": "Human",
      "Curse item": 10,
      "Levels": 2
    },
    "#tab Part 3": {
      "Resource": "BRICK",
      "Monster 1": "Zombie",
      "Monster 2": "Ghoul",
      "Key 1": "Silver key",
      "Key 2": "Cooper key",
      "Language": "Human",
      "Curse item": 10,
      "Levels": 1,
      "Boss": "Wight"
    },
    "#tab Part 4": {
      "Language": "Dwarf"
    }
  },
  {
    "objectid": "Event",
    "ID": "Dwarven strike",
    "Text": "#NPC 56\nIn middle of day you see a group of dwarven worker, cornered their human boss. They demand more pays for work. Boss don't agreed. You think that the boss will be beaten a for a few moments.",
    "1)": "Talk to dwarven workers and convice them not demand more pay.",
    "2)": "Talk to human boos and convice him to pay more to this poor dwarfs.",
    "Starting": true,
    "#tab Result 1": {
      "Text": "Argessive dwarven workers calm down when see, that dwarf from party talk to them. By short conversation you convice them to do work. After all you make agreement for small raising payments and all go to work.",
      "Action 1": "Case1",
      "Action 2": "Dwarf",
      "Action 3": "Gain Prosperty"
    },
    "#tab Result 2": {
      "Text": "Beside all of you efforts, workers refuse talk with you, calling you \"part of a problem\". After all strike get dowm, but no one is satisfied it result.",
      "Action 1": "Case1",
      "Action 2": "Reshufle"
    },
    "#tab Result 3": {
      "Text": "\"I can't pay more\" - sad boss. But after short coversation with your fighter when he \"explain\" to boss that he can pay more, boss agreed. All is satisfied.",
      "Action 1": "Case2",
      "Action 2": "Fighter",
      "Action 3": "Gain Prosperty"
    },
    "#tab Result 4": {
      "Text": "You can't convice boss - only anger him. After all dwarven agreed back to work, but probles is not be solved.",
      "Action 1": "Case2",
      "Action 2": "Reshufle"
    }
  },
  {
    "objectid": "Event",
    "ID": "Tavern Fight",
    "Text": "#SCENES 0\nYou decide to unwind at the local tavern, but just as you are starting to relax, a bear of a man crashes into your table, scattering your drinks across the floor.\nTowering over him is a massive dwarf. \"What did you say about my bread?\" the dwarf shouts. The man stands up and brushes shards of glass from his tunic. \"I said the sight of it makes me want to vomit!\"\nThe dwarf roars and charges into the man, crashing through more tables in the process. At this, the entire tavern erupts into violence. After all, when a man is deep into his drink, the last thing you want to do is knock that drink over.",
    "1)": "Join the fray! These insults will not go unanswered!",
    "2)": "Do your best to stop the fighting. This is a respectable establishment.",
    "Starting": true,
    "#tab Result 1": {
      "Text": "Nothing like busting some drunken skulls to lift one's spirits. It turns out to be a great way to unwind. Unfortunately, the proprietor of the local tavern doesn't exactly see it that way, and he sullenly asks for compensation for the damage you caused.",
      "Action 1": "Case1",
      "Action 2": "Gain 100 experiences",
      "Action 3": "Lose 20 gold coins or reputation"
    },
    "#tab Result 2": {
      "Text": "After restraining the enraged dwarf and offering to replace the drinks of a few of the more belligerent patrons, you calm the place down a bit. Some of the non-human patrons are understandably on edge, but the proprietor thanks you for your efforts and reimburses you for the drinks.",
      "Action 1": "Case2",
      "Action 2": "Gain Reputation"
    },
    "#tab Result 3": {

    },
    "#tab Result 4": {

    }
  },
  {
    "objectid": "Event",
    "ID": "Halfling rogue",
    "Text": "#SCENES 2\nAs the daylight fades, you find yourselves wandering through a half-crowded market street, browsing wares.\n#NPC 71\n\"Hey! Over here!\" You turn in the direction of the voice to see a filthy halfling gesturing from a dark alley.\n\"Yeah, you grim - looking chaps. I have something you might be interested in.\"\nThe halfling holds out a piece of metal covered in sludge. \"Found this in the sewer. Writing on it I don't understand, but I know it's valuable. You can have it for ten gold!\"",
    "1)": "Pay for the thing. You never know.",
    "2)": "Refuse to pay. Never trust a rogue halfling.",
    "#tab Result 1": {
      "Text": "You hand over the gold and take hold of the piece of garbage. Amidst troubling brown smears you see a lot of meaningless scratches likely made by rats and bugs. Oh well. Sometimes the long shot doesn't pay off.",
      "Action 1": "Case1",
      "Action 2": "Pay 10 gold coins"
    },
    "#tab Result 2": {
      "Text": "\"Bah! You don't have enough. Come back when you do!\"",
      "Action 1": "Case1",
      "Action 2": "Reshufle"
    },
    "#tab Result 3": {
      "Text": "You laugh and gesture the halfling away. You can recognize a low - life swindler when you see one. And that piece of garbage was just...foul.",
      "Action 1": "Case2"
    },
    "#tab Result 4": {

    }
  },
  {
    "objectid": "Event",
    "ID": "Halfling rogue curious item",
    "Text": "#SCENES 2\nAs the daylight fades, you find yourselves wandering through a half-crowded market street, browsing wares.\n#NPC 71\n\"Hey! Over here!\" You turn in the direction of the voice to see a filthy halfling gesturing from a dark alley.\n\"Yeah, you grim - looking chaps. I have something you might be interested in.\"\nThe halfling holds out a piece of metal covered in sludge. \"Found this in the sewer. Writing on it I don't understand, but I know it's valuable. You can have it for ten gold!\"",
    "1)": "Pay for the thing. You never know.",
    "2)": "Refuse to pay. Never trust a rogue halfling.",
    "#tab Result 1": {
      "Text": "You hand over the gold and take hold of the metal. You wipe off the grime and slop to discover a foreign contraption made of large gears and many moving parts. If you can figure out what it is, this device might actually be of some worth.",
      "Action 1": "Case1",
      "Action 2": "Pay 10 gold coins",
      "Action 3": "Gain Rare Weapon"
    },
    "#tab Result 2": {
      "Text": "\"Bah! You don't have enough. Come back when you do!\"",
      "Action 1": "Case1",
      "Action 2": "Reshufle"
    },
    "#tab Result 3": {
      "Text": "You laugh and gesture the halfling away. You can recognize a low - life swindler when you see one. And that piece of garbage was just...foul.",
      "Action 1": "Case2"
    },
    "#tab Result 4": {
    }
  },
  {
    "objectid": "Event",
    "ID": "Boy looking cat",
    "Text": "#NPC 72\nHaving recently returned from your latest adventure, you are approached by a ratty-looking boy in tears.\n\"Please, sirs, could you please help me with my cat? He went over there, and I'm afraid.\" The boy points a dirty finger at a decrepit, abandoned building. \"I don't know what else to do.\"",
    "1)": "Find a cat? You have more important things to do.",
    "2)": "Reassure the boy and go find the cat.",
    "#tab Result 1": {
      "Text": "You shake your head and direct the boy to go find his mother. With any luck she will knock some sense into him so that he stops troubling strangers with such trivial matters.",
      "Action 1": "Case1"
    },
    "#tab Result 2": {
      "Text": "You approach the foreboding house full of heroic bravado. There's certainly nothing otherworldly about the structure, but its fallen beams and piles of rubble do make it difficult to look around. By the time you find the cat hiding under a burned-out bed frame, you are utterly exhausted. At least the boy is ecstatic his cat has been found.",
      "Action 1": "Case2",
      "Action 2": "Gain Reputation",
      "Action 3": "Exhause party"
    }
  },
  {
    "objectid": "Event",
    "ID": "Building sanctuary",
    "Text": "#BUILDNGS 23\nAfter resting for the evening, you start out your day noticing a great number of prominent, commanding posters around the city.\nReading one, you learn that the local group of priests is laying down the foundation for a new building on the east side of this settlement. Everyone is encouraged to come and help. This could be an important community event.",
    "1)": "Go help lay the foundation.",
    "2)": "Take the opportunity to steal some valuables in the area while people are distracted.",
    "#tab Result 1": {
      "Text": "Amidst a great deal of revelry, you put all you have into laying the foundation of the sanctuary. Surely much good will be done here healing the sick and wounded. After all your exhaustive efforts, though, you might end up being their first patients.",
      "Action 1": "Case1",
      "Action 2": "Exhause party",
      "Action 3": "Gain Reputation",
      "Action 4": "Gain Prosperty"
    },
    "#tab Result 2": {
      "Text": "You head to the prosperous east side of town, not to help lay down the foundation, but to steal some goods from shopkeepers too silly to lock up their wares during the festivities. You make off with a good deal of money and the distracted guards are none the wiser.\n\nReputation < -4: Gain 5 additional gold each.",
      "Action 1": "Case2",
      "Action 2": "Gain 20 gold coins",
      "Action 3": "Gain 20 gold if Reputation < -4"
    }
  },
  {
    "objectid": "Event",
    "ID": "Test",
    "Text": "#BUILDNGS 23\nTest damage.",
    "1)": "Apply damage.",
    "2)": "Apply exhause.",
    "#tab Result 1": {
      "Text": "You are damaged.",
      "Action 1": "Case1",
      "Action 2": "Attack 1-3"
    },
    "#tab Result 2": {
      "Text": "You are exhaused.",
      "Action 1": "Case2",
      "Action 2": "Exhause party"
    }
  }
]